RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_fmc.h
/*!
    \file    gd32h7xx_fmc.h
    \brief   definitions for the FMC

    \version 2024-01-05, V1.2.0, firmware for GD32H7xx
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H7XX_FMC_H
#define GD32H7XX_FMC_H

#include "gd32h7xx.h"

/* FMC definition */
#define FMC                               FMC_BASE                         /*!< FMC register base address */

/* registers definitions */
#define FMC_KEY                           REG32((FMC) + 0x00000004U)       /*!< FMC unlock key register */
#define FMC_OBKEY                         REG32((FMC) + 0x00000008U)       /*!< FMC option byte unlock key register */
#define FMC_CTL                           REG32((FMC) + 0x0000000CU)       /*!< FMC control register */
#define FMC_STAT                          REG32((FMC) + 0x00000010U)       /*!< FMC status register */
#define FMC_ADDR                          REG32((FMC) + 0x00000014U)       /*!< FMC address register */
#define FMC_OBCTL                         REG32((FMC) + 0x00000018U)       /*!< FMC option byte control register */
#define FMC_OBSTAT0_EFT                   REG32((FMC) + 0x0000001CU)       /*!< FMC effective option byte status 0 register */
#define FMC_OBSTAT0_MDF                   REG32((FMC) + 0x00000020U)       /*!< FMC modified option byte status 0 register */
#define FMC_DCRPADDR_EFT                  REG32((FMC) + 0x00000028U)       /*!< FMC effective DCRP address register */
#define FMC_DCRPADDR_MDF                  REG32((FMC) + 0x0000002CU)       /*!< FMC modified DCRP address register */
#define FMC_SCRADDR_EFT                   REG32((FMC) + 0x00000030U)       /*!< FMC effective secure address register */
#define FMC_SCRADDR_MDF                   REG32((FMC) + 0x00000034U)       /*!< FMC modified secure address register */
#define FMC_WP_EFT                        REG32((FMC) + 0x00000038U)       /*!< FMC effective erase/program protection register */
#define FMC_WP_MDF                        REG32((FMC) + 0x0000003CU)       /*!< FMC modified erase/program protection register */
#define FMC_BTADDR_EFT                    REG32((FMC) + 0x00000040U)       /*!< FMC effective boot address register */
#define FMC_BTADDR_MDF                    REG32((FMC) + 0x00000044U)       /*!< FMC modified boot address register */
#define FMC_OBSTAT1_EFT                   REG32((FMC) + 0x00000050U)       /*!< FMC effective option byte status 1 register */
#define FMC_OBSTAT1_MDF                   REG32((FMC) + 0x00000054U)       /*!< FMC modified option byte status 1 register */
#define FMC_NODEC                         REG32((FMC) + 0x00000060U)       /*!< FMC NO-RTDEC area register */
#define FMC_ECCADDR                       REG32((FMC) + 0x00000064U)       /*!< FMC ECC error address register */
#define FMC_AESIV0_EFT                    REG32((FMC) + 0x00000068U)       /*!< FMC effective AES IV 0 register */
#define FMC_AESIV1_EFT                    REG32((FMC) + 0x0000006CU)       /*!< FMC effective AES IV 1 register */
#define FMC_AESIV2_EFT                    REG32((FMC) + 0x00000070U)       /*!< FMC effective AES IV 2 register */
#define FMC_AESIV0_MDF                    REG32((FMC) + 0x00000074U)       /*!< FMC modified AES IV 0 register */
#define FMC_AESIV1_MDF                    REG32((FMC) + 0x00000078U)       /*!< FMC modified AES IV 1 register */
#define FMC_AESIV2_MDF                    REG32((FMC) + 0x0000007CU)       /*!< FMC modified AES IV 2 register */
#define FMC_PID0                          REG32((FMC) + 0x00000100U)       /*!< FMC product ID register 0 */
#define FMC_PID1                          REG32((FMC) + 0x00000104U)       /*!< FMC product ID register 1 */

/* bits definitions */
/* FMC_KEY */
#define FMC_KEY_KEY                       BITS(0,31)                       /*!< FMC_CTL unlock key bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                   BITS(0,31)                       /*!< option byte unlock key bits */

/* FMC_CTL */
#define FMC_CTL_LK                        BIT(0)                           /*!< FMC_CTL lock bit */
#define FMC_CTL_PG                        BIT(1)                           /*!< main flash program command bit */
#define FMC_CTL_SER                       BIT(2)                           /*!< main flash sector erase command bit */
#define FMC_CTL_MER                       BIT(3)                           /*!< main flash mass erase command bit */
#define FMC_CTL_PGCHEN                    BIT(4)                           /*!< check programming area enable bit */
#define FMC_CTL_START                     BIT(7)                           /*!< send erase command to FMC bit */
#define FMC_CTL_ENDIE                     BIT(16)                          /*!< end of operation interrupt enable bit */
#define FMC_CTL_WPERRIE                   BIT(17)                          /*!< erase/program protection error interrupt enable bit */
#define FMC_CTL_PGSERRIE                  BIT(18)                          /*!< program sequence error interrupt enable bit */
#define FMC_CTL_RPERRIE                   BIT(23)                          /*!< read protection error interrupt enable bit */
#define FMC_CTL_RSERRIE                   BIT(24)                          /*!< read secure error interrupt enable bit */
#define FMC_CTL_ECCCORIE                  BIT(25)                          /*!< one bit correct error interrupt enable bit */
#define FMC_CTL_ECCDETIE                  BIT(26)                          /*!< two bits detect error interrupt enable bit */

